#include<stdio.h>//用户给定，参数作为用户给的参数，返回值为空
void bitswap(int a)//数字a 高低8位交换 中间字节交换
{
    int b,c;
    b=(a<<24)+(a>>24 & 0x000000ff);//如 0x12345678 变成 0x00000012 0x000000078 b=0x78000012 所以我们要将高位变0
    c=(a>>8 & 0x000ff00 ) + (a<<8 &0x00ff0000);// 0x00003400 0x00563400 (如何归0? 与0x0000ff00取&)
     printf("%#x\n",b+c);  //加法运算也可以换成 b|c(或运算，没有进位的加法运算) 也可以改成异或yun suan                                        //0x00560000 最后 c= 0x00563400
}

int main()
{
    int i;
    printf("input a HEX number:");
    scanf("%x",&i); 
    bitswap(i);
    return 1;
}
/*只允许使用位运算和赋值运算，其他运算符不能用，怎么做？看注释*/